In [38]:
import pandas as pd

In [39]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("mdferojahmed178/12000-house-price-list-from-10-states-of-usa")

print("Path to dataset files:", path)

Using Colab cache for faster access to the '12000-house-price-list-from-10-states-of-usa' dataset.
Path to dataset files: /kaggle/input/12000-house-price-list-from-10-states-of-usa

In [40]:
import os
print("Files in the downloaded dataset directory:")
print(os.listdir(path))
df = pd.read_csv(path + "/US houuse price of 10 states.csv")

Files in the downloaded dataset directory:
['US houuse price of 10 states.csv']

In [41]:
df.head(20)

,date,house_size,bed,bath,price,broker,street,city,state_name,zip_code
0,"AUG 29, 2024","2,520 sqft (on 0.44 acres)",4bd,4bd,"$415,000",NaN,2004 W 23rd Ct,Panama City,Florida,32405
1,"AUG 29, 2024",704 sqft (on 0.33 acres),2bd,2bd,"$58,000",NaN,5390 Webb St,Graceville,Florida,32440
2,"AUG 29, 2024","1,926 sqft (on 0.45 acres)",3bd,3bd,"$375,000",Coldwell Banker Hartung,6761 Landover Cir,Tallahassee,Florida,32317
3,"AUG 29, 2024","1,132 sqft",Studio,Studio,"$190,000","EXP Realty, LLC",1701 S Fairfield Dr,Perdido Key,Florida,32507
4,"AUG 29, 2024","1,205 sqft",3bd,3bd,"$233,900","D R Horton Realty of NW Florida, LLC",6274 June Bug Dr,Milton,Florida,32583
5,"AUG 29, 2024","3,044 sqft (on 0.34 acres)",4bd,4bd,"$416,402","ADAMS HOME REALTY, INC",6528 Benelli Dr,Milton,Florida,32570
6,"AUG 29, 2024",NaN,NaN,NaN,"$30,000",Waypoint Properties,Lot 34&35 Menomini St #3,Crawfordville,Florida,32327
7,"AUG 29, 2024",NaN,NaN,NaN,"$2,650,000",Compass,Ac29 Sea Garden St,Alys Beach,Florida,32461
8,"AUG 28, 2024","1,422 sqft",2bd,2bd,"$455,000",NaN,122 3rd St,Mexico Beach,Florida,32456
9,"AUG 28, 2024","1,192 sqft",2bd,2bd,"$325,000",NaN,4026 Kirkpatrick Rd,Southport,Florida,32409
10,"AUG 28, 2024","1,143 sqft",2bd,2bd,"$255,000",NaN,6527 Harbour Blvd,Panama City Beach,Florida,32407
11,"AUG 28, 2024",740 sqft,1bd,1bd,"$295,000",NaN,8743 Thomas Dr #926,Panama City Beach,Florida,32408
12,"AUG 28, 2024","1,778 sqft (on 0.25 acres)",4bd,4bd,"$325,000",NaN,305 E Gulf Blvd,Panama City Beach,Florida,32413
13,"AUG 28, 2024","1,254 sqft",2bd,2bd,"$250,000",JANET COULTER REALTY,520 Richard Jackson Blvd #2810,Panama City Beach,Florida,32407
14,"AUG 28, 2024","1,820 sqft",3bd,3bd,"$330,500","EXP Realty, LLC",8564 Westview Ln,Pensacola,Florida,32514
15,"AUG 28, 2024","1,370 sqft",3bd,3bd,"$173,000",Better Homes And Gardens Real Estate Main Stre...,6905 Woodley Dr,Pensacola,Florida,32503
16,"AUG 28, 2024","2,630 sqft (on 0.38 acres)",4bd,4bd,"$749,000",Kuhn Realty,3300 Baisden Rd,Pensacola,Florida,32503
17,"AUG 28, 2024","2,681 sqft (on 1.82 acres)",3bd,3bd,"$525,000",American Valor Realty LLC,8021 Quiet Dr,Pensacola,Florida,32526
18,"AUG 28, 2024","1,455 sqft (on 0.75 acres)",3bd,3bd,"$260,000",Levin Rinke Realty,320 Tallow Tree Dr,Pensacola,Florida,32506
19,"AUG 28, 2024","1,380 sqft (on 1 acre)",3bd,3bd,"$183,000","PHD Real Estate, LLC",3991 Macks Rd,Century,Florida,32535

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12075 entries, 0 to 12074
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        12075 non-null  object
 1   house_size  11107 non-null  object
 2   bed         11410 non-null  object
 3   bath        11410 non-null  object
 4   price       11009 non-null  object
 5   broker      9569 non-null   object
 6   street      12075 non-null  object
 7   city        12075 non-null  object
 8   state_name  12075 non-null  object
 9   zip_code    12075 non-null  int64
dtypes: int64(1), object(9)
memory usage: 943.5+ KB

In [43]:
df.isnull().sum()    #finding null values

date             0
house_size     968
bed            665
bath           665
price         1066
broker        2506
street           0
city             0
state_name       0
zip_code         0
dtype: int64

In [44]:
df.isnull().sum().sum()   #total null values in dataset

np.int64(5870)

In [45]:
df["house_size"] = df["house_size"].fillna(df["house_size"].mode()[0])       #handling missing values in the given column with mode method

In [46]:
df.isnull().sum()

date             0
house_size       0
bed            665
bath           665
price         1066
broker        2506
street           0
city             0
state_name       0
zip_code         0
dtype: int64

In [47]:
df["bed"] = df["bed"].fillna(df["bed"].mode()[0])

In [48]:
df.isnull().sum()

date             0
house_size       0
bed              0
bath           665
price         1066
broker        2506
street           0
city             0
state_name       0
zip_code         0
dtype: int64

In [49]:
df["bath"] = df["bath"].fillna(df["bath"].mode()[0])

In [50]:
df.isnull().sum()

date             0
house_size       0
bed              0
bath             0
price         1066
broker        2506
street           0
city             0
state_name       0
zip_code         0
dtype: int64

In [51]:
df["broker"] = df["broker"].fillna("Unkown")     #fill nun values of broker with a string

In [52]:
df.isnull().sum()

date             0
house_size       0
bed              0
bath             0
price         1066
broker           0
street           0
city             0
state_name       0
zip_code         0
dtype: int64

In [66]:
df.to_csv("Cleaned_data.csv")